// text.js
const TEXT = {
  welcome: "Добро пожаловать!",
  intro: "Собери узоры и стань мастером паттернов!",
  start: "Начать игру",

  title: "Составь узор",
  rulesTitle: "Правила игры:",
  rules: [
    "Перетаскивайте элементы из левого окна в центральное поле.",
    "Составьте точно такой же узор, как показан справа.",
    "Нажмите «Проверить», когда будете готовы.",
    "Попробуйте собрать узор как можно быстрее!",
    "Чтобы удалить фигуру, кликните по ней."
  ],
  levelPrefix: "Уровень",

  buttons: {
    check: "Проверить",
    reset: "Начать заново",
    contrast: "Режим контраста",
    next: "Следующий уровень",
    restart: "Начать сначала",
    ok: "Ок"
  },

  modals: {
    successTitle: "Отлично!",
    successImg: "assets/welldone.gif",
    failTitle: "Попробуй снова!",
    failImg: "assets/bed.gif",
    finalTitle: "Поздравляем!",
    finalText: "Вы прошли все уровни!"
  },

  timerLabel: "Время"
};
